Revit 2027 API
PointNode Properties
The PointNode type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RenderNode)
LineProperties |  Access to the line (pen) properties of the curve being drawn
(Inherited from ModelCurveNode)
NodeName |  A readable name of the output node.
(Inherited from RenderNode)
Top
See Also
Reference
PointNode Class
Autodesk.Revit.DB Namespace